app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES ('2011-06-02 10:23:46.108343', 'user@example.com', '0503e0a2378e0c92500d7a889faa37692bb90c988bb8e06587a8f31348b644b3', 'New User', 'f683307101ded0acac16edf6f9352532d32685025dfc2478af20d44c2b6c67a1', '2011-06-02 10:23:46.108343')
---
  def create
    @user = User.new(params[:user])
    if @user.save